src/DataProcessors/ФормыПодборов/ФормыПодборов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормыПодборов</name>
</mdclass:DataProcessor>

src/Catalogs/ФинансовыеЦели/ФинансовыеЦели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФинансовыеЦели</name>
  <predefined>
    <items>
      <name>ОбщиеНакопления</name>
      <description>Общие накопления (без указания цели)</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеФинансовойЦели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Срок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНакопления</name>
    <type>
      <types>DocumentRef.Доход</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ФормыПодборов/Forms/ЗапросСуммыДохода/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФинЦельПоУмолчанию = Справочники.ФинансовыеЦели.ОбщиеНакопления;
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Кошелек,Сумма,ФинансоваяЦель,КомментарийСтроки");
	ОбновитьПараметрыКошелька(Кошелек, ВалютаКошелька, ВидимостьФинансовойЦели);
	Элементы.ФинансоваяЦель.Доступность = ВидимостьФинансовойЦели;
	Если НЕ ВидимостьФинансовойЦели Тогда
		ФинансоваяЦель = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ФинансоваяЦель) Тогда
		ФинансоваяЦель = ФинЦельПоУмолчанию;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОк(Команда)
	
	Результат = Новый Структура("Кошелек,Валюта,Сумма,КомментарийСтроки,ФинансоваяЦель,ВидимостьФинансовойЦели",
		Кошелек, ВалютаКошелька, Сумма, КомментарийСтроки, ФинансоваяЦель, ВидимостьФинансовойЦели);
	Закрыть(Результат);
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОбновитьПараметрыКошелька(Знач Кошелек, Валюта, ФлагНакоплений)

	Если ЗначениеЗаполнено(Кошелек) Тогда
		Валюта = Кошелек.Валюта;
		ФлагНакоплений = Кошелек.ИспользоватьДляНакоплений;
	Иначе
		Валюта = Константы.ВалютаУчета.Получить();
		ФлагНакоплений = Ложь;
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура КошелекПриИзменении(Элемент)
	
	ОбновитьПараметрыКошелька(Кошелек, ВалютаКошелька, ВидимостьФинансовойЦели);
	Элементы.ФинансоваяЦель.Доступность = ВидимостьФинансовойЦели;
	Если НЕ ВидимостьФинансовойЦели Тогда
		ФинансоваяЦель = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ФинансоваяЦель) Тогда
		ФинансоваяЦель = ФинЦельПоУмолчанию;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ФинансоваяЦельПриИзменении(Элемент)
	
	Если НЕ ВидимостьФинансовойЦели Тогда
		ФинансоваяЦель = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ФинансоваяЦель) Тогда
		ФинансоваяЦель = ФинЦельПоУмолчанию;
	КонецЕсли; 
	
КонецПроцедуры
